src/Reports/ОтчётПоНормированиюУДПоРабочимМестам/ОтчётПоНормированиюУДПоРабочимМестам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоНормированиюУДПоРабочимМестам</name>
</mdclass:Report>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПерспективныеПланы/ПерспективныеПланы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПерспективныеПланы</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезПриб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезКм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчётПоНормированиюУДПоРабочимМестам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
Период.ДатаОкончания = ТекущаяДата();
КонецПроцедуры
 
&НаСервере          
Функция ПолучитьРабочееМесто(ТО,Линейка)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеекТехОперации.ТехОперация КАК ТехОперация,
	|	РабочиеМестаЛинеекТехОперации.Ссылка КАК РМ
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек.ТехОперации КАК РабочиеМестаЛинеекТехОперации
	|ГДЕ
	|	РабочиеМестаЛинеекТехОперации.Ссылка.Линейка = &Линейка";
Запрос.УстановитьПараметр("Линейка", Линейка); 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ТехОперация.ЭтоГруппа Тогда
			Если ТО.ПринадлежитЭлементу(ВыборкаДетальныеЗаписи.ТехОперация) Тогда
			Возврат(ВыборкаДетальныеЗаписи.РМ);	
			КонецЕсли;		
		ИначеЕсли ТО = ВыборкаДетальныеЗаписи.ТехОперация Тогда						
		Возврат(ВыборкаДетальныеЗаписи.РМ);
		КонецЕсли; 
	КонецЦикла; 
Возврат(Неопределено);
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуРМ(ТаблицаРМ,СписокТО,ЭтапСпецификации,Линейка,НаДату,КолУзла,СписокРМ = Неопределено,ВСписке = Истина)
СписокГруппРМ = Новый СписокЗначений;
Запрос = Новый Запрос; 
  
Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент,
	|	НормыРасходовСрезПоследних.Норма,
	|	НормыРасходов.ВидЭлемента
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.Владелец = &Владелец
	|	И НормыРасходов.Элемент ССЫЛКА Справочник.ТехОперации
	|	И НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходовСрезПоследних.Норма > 0";
//Запрос.УстановитьПараметр("НаДату", ?(ЗначениеЗаполнено(НаДату),НаДату,ТекущаяДата()));
Запрос.УстановитьПараметр("НаДату", Период.ДатаОкончания);
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	РМ = ПолучитьРабочееМесто(ВыборкаДетальныеЗаписи.Элемент,Линейка);
		Если РМ = Неопределено Тогда
			Если СписокТО.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Элемент) = Неопределено Тогда
			СписокТО.Добавить(ВыборкаДетальныеЗаписи.Элемент);
			КонецЕсли;			
		КонецЕсли;
			Если СписокРМ <> Неопределено Тогда
				Если ВСписке Тогда
					Если СписокРМ.НайтиПоЗначению(РМ) = Неопределено Тогда
					Продолжить;
					КонецЕсли;				
				Иначе	
					Если СписокРМ.НайтиПоЗначению(РМ) <> Неопределено Тогда
					Продолжить;
					КонецЕсли;				
				КонецЕсли;			
			КонецЕсли;
				Если РМ <> Неопределено Тогда
					Если Найти(РМ.Наименование,"(") > 0 Тогда
					НаименованиеРМ = СокрЛП(Лев(РМ.Наименование,Найти(РМ.Наименование,"(")-1));	
					Иначе	
					НаименованиеРМ = СокрЛП(РМ.Наименование);
					КонецЕсли;				
				Иначе	
				НаименованиеРМ = "";			
				КонецЕсли;
	ТЧ = ТаблицаРМ.Добавить();
	ТЧ.РМ = НаименованиеРМ;   
	//НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(НаДату,Новый Структура("ТехОперация",ВыборкаДетальныеЗаписи.Элемент));		
	НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Период.ДатаОкончания,Новый Структура("ТехОперация",ВыборкаДетальныеЗаписи.Элемент));
	НВ = НормыТО.Норма;
	Стоимость = Окр(НВ/60*НормыТО.Стоимость,2,РежимОкругления.Окр15как20);
	ТЧ.НВ = НВ*ВыборкаДетальныеЗаписи.Норма*КолУзла;
	ТЧ.Стоимость = Стоимость*ВыборкаДетальныеЗаписи.Норма*КолУзла; 
		Если СписокГруппРМ.НайтиПоЗначению(НаименованиеРМ) = Неопределено Тогда
		ТЧ.Количество = 1;
		СписокГруппРМ.Добавить(НаименованиеРМ);		
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры
               
&НаСервере
Функция ПолучитьСписокРМ()
Запрос = Новый Запрос;
СписокРМ = Новый СписокЗначений;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Наименование КАК Наименование
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Ссылка.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ";
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Если Найти(ВыборкаДетальныеЗаписи.Наименование,"(") > 0 Тогда
		НаименованиеРМ = СокрЛП(Лев(ВыборкаДетальныеЗаписи.Наименование,Найти(ВыборкаДетальныеЗаписи.Наименование,"(")-1));	
		Иначе	
		НаименованиеРМ = СокрЛП(ВыборкаДетальныеЗаписи.Наименование);
		КонецЕсли;
			Если СписокРМ.НайтиПоЗначению(НаименованиеРМ) = Неопределено Тогда
			СписокРМ.Добавить(НаименованиеРМ);		
			КонецЕсли; 
	КонецЦикла; 
СписокРМ.СортироватьПоЗначению();
Возврат(СписокРМ); 
КонецФункции
    
&НаСервере
Функция КоличествоРМВЛинейке(Линейка)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка = &Линейка
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
	|	И РабочиеМестаЛинеек.Авторизовано = ИСТИНА";
Запрос.УстановитьПараметр("Линейка", Линейка); 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Возврат(ВыборкаДетальныеЗаписи.Количество());
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

Запрос = Новый Запрос;               
СписокТО = Новый СписокЗначений;
ТаблицаРМ = Новый ТаблицаЗначений; 
ТаблицаРМОбщ = Новый ТаблицаЗначений;

ТаблицаРМ.Колонки.Добавить("РМ");
ТаблицаРМ.Индексы.Добавить("РМ");
ТаблицаРМ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0)));
ТаблицаРМ.Колонки.Добавить("НВ",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,4)));
ТаблицаРМ.Колонки.Добавить("Стоимость",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(16,2)));

ТаблицаРМОбщ.Колонки.Добавить("РМ");
ТаблицаРМОбщ.Индексы.Добавить("РМ");
ТаблицаРМОбщ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0)));
ТаблицаРМОбщ.Колонки.Добавить("НВ",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,4)));
ТаблицаРМОбщ.Колонки.Добавить("Стоимость",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(16,2)));
     
СписокРМ = ПолучитьСписокРМ();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблШапкаРабочееМесто = Макет.ПолучитьОбласть("Шапка|РабочееМесто");
ОблШапкаИтого = Макет.ПолучитьОбласть("Шапка|Итого");
ОблИзделиеОбщая = Макет.ПолучитьОбласть("Изделие|Общая");
ОблИзделиеРабочееМесто = Макет.ПолучитьОбласть("Изделие|РабочееМесто");
ОблИзделиеИтого = Макет.ПолучитьОбласть("Изделие|Итого");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблКонецРабочееМесто = Макет.ПолучитьОбласть("Конец|РабочееМесто");
ОблКонецИтого = Макет.ПолучитьОбласть("Конец|Итого"); 

ОблШапкаОбщая.Параметры.ДатаНач = Формат(Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ДатаКон = Формат(Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ВидОтчёта = ?(БезУчётаВыходныхДней,"Без учёта выходных дней: "+СписокВыходныхДней,"По всем дням недели");
ТабДок.Вывести(ОблШапкаОбщая);
	Для каждого РМ Из СписокРМ Цикл
	ОблШапкаРабочееМесто.Параметры.РабочееМесто = РМ.Значение;	
	ТабДок.Присоединить(ОблШапкаРабочееМесто);				
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтого);
НВИтогоВсего = 0;
СтоимостьИтогоВсего = 0;
КоличествоВсего = 0;

	Если ВидОтчёта = 0 Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственноеЗадание.Изделие КАК Изделие,
		|	ПроизводственноеЗадание.Количество КАК Количество,
		|	ПроизводственноеЗадание.ДатаЗапуска КАК ДатаЗапуска
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ПроизводственноеЗадание.Линейка В ИЕРАРХИИ(&СписокЛинеек)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроизводственноеЗадание.Изделие.Товар.Наименование
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Изделие,
		|	ДатаЗапуска";
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания); 
	Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИзделие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИзделие.Следующий() Цикл
		СписокТО.Очистить();
		ТаблицаРМ.Очистить();
		ВыборкаДаты = ВыборкаИзделие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДаты.Следующий() Цикл
            ЗаполнитьТаблицуРМ(ТаблицаРМ,СписокТО,ВыборкаИзделие.Изделие,ВыборкаИзделие.Изделие.Линейка,ВыборкаДаты.ДатаЗапуска,ВыборкаДаты.Количество);
			КонецЦикла;
		НВИтого = 0;
		СтоимостьИтого = 0;
		ТаблицаРМ.Свернуть("РМ","Количество,НВ,Стоимость");
		ТаблицаРМ.Сортировать("РМ");
			Для каждого ТЧ Из ТаблицаРМ Цикл
			ТЧ_О = ТаблицаРМОбщ.Добавить();
			ТЧ_О.РМ = ТЧ.РМ;
			ТЧ_О.Количество = ТЧ.Количество;	
			ТЧ_О.НВ = ТЧ.НВ;
			ТЧ_О.Стоимость = ТЧ.Стоимость;			
			КонецЦикла;
		ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ВыборкаИзделие.Изделие.Наименование);
		ОблИзделиеОбщая.Параметры.Изделие = ВыборкаИзделие.Изделие;
		ОблИзделиеОбщая.Параметры.ГруппаЛинеек = СокрЛП(ВыборкаИзделие.Изделие.Линейка.Родитель.Наименование); 
		ОблИзделиеОбщая.Параметры.Количество = ВыборкаИзделие.Количество;
			Если СписокТО.Количество() > 0 Тогда
			ОблИзделиеОбщая.Параметры.Ошибки = "!";
            ОблИзделиеОбщая.Параметры.СписокТО = СписокТО;
			Иначе
			ОблИзделиеОбщая.Параметры.Ошибки = "";
			КонецЕсли;
		ТабДок.Вывести(ОблИзделиеОбщая); 
		КоличествоВсего = КоличествоВсего + ВыборкаИзделие.Количество;
			Для каждого РМ Из СписокРМ Цикл 
			Выборка = ТаблицаРМ.Найти(РМ.Значение,"РМ");
				Если Выборка <> Неопределено Тогда
				ОблИзделиеРабочееМесто.Параметры.НВ = Выборка.НВ;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = Выборка.Стоимость;
				НВИтого = НВИтого + Выборка.НВ;                               
				НВИтогоВсего = НВИтогоВсего + Выборка.НВ;
				СтоимостьИтого = СтоимостьИтого + Выборка.Стоимость;
				СтоимостьИтогоВсего = СтоимостьИтогоВсего + Выборка.Стоимость;				
				Иначе	
				ОблИзделиеРабочееМесто.Параметры.НВ = 0;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = 0;				
				КонецЕсли;	
			ТабДок.Присоединить(ОблИзделиеРабочееМесто);				
			КонецЦикла;    
		ОблИзделиеИтого.Параметры.НВ = НВИтого;
		ОблИзделиеИтого.Параметры.Стоимость = СтоимостьИтого;
		ТабДок.Присоединить(ОблИзделиеИтого);
		КонецЦикла;
	ИначеЕсли ВидОтчёта = 1 Тогда
		Если БезУчётаВыходныхДней Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыпускПродукцииПоступление.Номенклатура КАК Изделие,
			|	ВыпускПродукцииПоступление.Количество КАК Количество,
			|	ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДатаЗапуска КАК ДатаЗапуска
			|ИЗ
			|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
			|ГДЕ
			|	ВыпускПродукцииПоступление.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|	И НЕ НАЧАЛОПЕРИОДА(ВыпускПродукцииПоступление.Ссылка.Дата, ДЕНЬ) В (&СписокВыходныхДней)
			|	И ВыпускПродукцииПоступление.Ссылка.НаСклад = ИСТИНА
			|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
			|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДокументОснование.Статус = 3
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВыпускПродукцииПоступление.Номенклатура.Товар.Наименование
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	Изделие,
			|	ДатаЗапуска";
		Запрос.УстановитьПараметр("СписокВыходныхДней", СписокВыходныхДней);		
		Иначе	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыпускПродукцииПоступление.Номенклатура КАК Изделие,
			|	ВыпускПродукцииПоступление.Количество КАК Количество,
			|	ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДатаЗапуска КАК ДатаЗапуска
			|ИЗ
			|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
			|ГДЕ
			|	ВыпускПродукцииПоступление.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|	И ВыпускПродукцииПоступление.Ссылка.НаСклад = ИСТИНА
			|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
			|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДокументОснование.Статус = 3
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВыпускПродукцииПоступление.Номенклатура.Товар.Наименование
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	Изделие,
			|	ДатаЗапуска";		
		КонецЕсли; 
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания); 
	Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИзделие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИзделие.Следующий() Цикл
		СписокТО.Очистить(); 
		ТаблицаРМ.Очистить();
		ВыборкаДаты = ВыборкаИзделие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДаты.Следующий() Цикл
            ЗаполнитьТаблицуРМ(ТаблицаРМ,СписокТО,ВыборкаИзделие.Изделие,ВыборкаИзделие.Изделие.Линейка,ВыборкаДаты.ДатаЗапуска,ВыборкаДаты.Количество);
			КонецЦикла;
		НВИтого = 0;
		СтоимостьИтого = 0;
		ТаблицаРМ.Свернуть("РМ","Количество,НВ,Стоимость");
		ТаблицаРМ.Сортировать("РМ");
			Для каждого ТЧ Из ТаблицаРМ Цикл
			ТЧ_О = ТаблицаРМОбщ.Добавить();
			ТЧ_О.РМ = ТЧ.РМ;
			ТЧ_О.Количество = ТЧ.Количество;	
			ТЧ_О.НВ = ТЧ.НВ;
			ТЧ_О.Стоимость = ТЧ.Стоимость;			
			КонецЦикла;
		ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ВыборкаИзделие.Изделие.Наименование);
		ОблИзделиеОбщая.Параметры.Изделие = ВыборкаИзделие.Изделие;
		ОблИзделиеОбщая.Параметры.ГруппаЛинеек = СокрЛП(ВыборкаИзделие.Изделие.Линейка.Родитель.Наименование); 
		ОблИзделиеОбщая.Параметры.Количество = ВыборкаИзделие.Количество;
			Если СписокТО.Количество() > 0 Тогда
			ОблИзделиеОбщая.Параметры.Ошибки = "!";
            ОблИзделиеОбщая.Параметры.СписокТО = СписокТО;
			Иначе
			ОблИзделиеОбщая.Параметры.Ошибки = "";
			КонецЕсли;
		ТабДок.Вывести(ОблИзделиеОбщая);
		КоличествоВсего = КоличествоВсего + ВыборкаИзделие.Количество;
			Для каждого РМ Из СписокРМ Цикл 
			Выборка = ТаблицаРМ.Найти(РМ.Значение,"РМ");
				Если Выборка <> Неопределено Тогда
				ОблИзделиеРабочееМесто.Параметры.НВ = Выборка.НВ;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = Выборка.Стоимость;
				НВИтого = НВИтого + Выборка.НВ;
				НВИтогоВсего = НВИтогоВсего + Выборка.НВ;
				СтоимостьИтого = СтоимостьИтого + Выборка.Стоимость;
				СтоимостьИтогоВсего = СтоимостьИтогоВсего + Выборка.Стоимость;				
				Иначе	
				ОблИзделиеРабочееМесто.Параметры.НВ = 0;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = 0;				
				КонецЕсли;	
			ТабДок.Присоединить(ОблИзделиеРабочееМесто);				
			КонецЦикла;    
		ОблИзделиеИтого.Параметры.НВ = НВИтого;
		ОблИзделиеИтого.Параметры.Стоимость = СтоимостьИтого;
		ТабДок.Присоединить(ОблИзделиеИтого);
		КонецЦикла;
	ИначеЕсли ВидОтчёта = 2 Тогда
	СписокРМ_ПЗ = Новый СписокЗначений;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственноеЗадание.Изделие КАК Изделие,
		|	ПроизводственноеЗадание.Количество КАК Количество,
		|	ПроизводственноеЗадание.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ПроизводственноеЗадание.ДатаЗапуска МЕЖДУ &ДатаНач И &ДатаКон
		|	И ПроизводственноеЗадание.Линейка В ИЕРАРХИИ(&СписокЛинеек)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроизводственноеЗадание.Изделие.Товар.Наименование
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Изделие";
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания); 
	Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИзделие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИзделие.Следующий() Цикл 
		Количество = 0;
		СписокТО.Очистить();               
		ТаблицаРМ.Очистить();
		ВыборкаДетальныхЗаписей = ВыборкаИзделие.Выбрать();
			Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
			СписокРМ_ПЗ.Очистить();
			ЭПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.СоздатьНаборЗаписей();
			ЭПЗ.Отбор.ПЗ.Установить(ВыборкаДетальныхЗаписей.Ссылка);
			ЭПЗ.Прочитать();
				Для каждого Запись Из ЭПЗ Цикл
					Если (Запись.ДатаОкончания >= Период.ДатаНачала)и(Запись.ДатаОкончания <= Период.ДатаОкончания) Тогда
					СписокРМ_ПЗ.Добавить(Запись.РабочееМесто);	
					КонецЕсли;
				КонецЦикла;                                 
					Если СписокРМ_ПЗ.Количество() < КоличествоРМВЛинейке(ВыборкаДетальныхЗаписей.Ссылка.Линейка) Тогда
					ЗаполнитьТаблицуРМ(ТаблицаРМ,СписокТО,ВыборкаИзделие.Изделие,ВыборкаИзделие.Изделие.Линейка,ВыборкаДетальныхЗаписей.Ссылка.ДатаЗапуска,ВыборкаДетальныхЗаписей.Ссылка.Количество,СписокРМ_ПЗ,Истина);					
					Количество = Количество + ВыборкаДетальныхЗаписей.Ссылка.Количество;
					КонецЕсли;			
			КонецЦикла;
				Если Количество = 0 Тогда
				Продолжить;
				КонецЕсли; 
		НВИтого = 0;
		СтоимостьИтого = 0;
		ТаблицаРМ.Свернуть("РМ","Количество,НВ,Стоимость");
		ТаблицаРМ.Сортировать("РМ");
			Для каждого ТЧ Из ТаблицаРМ Цикл
			ТЧ_О = ТаблицаРМОбщ.Добавить();
			ТЧ_О.РМ = ТЧ.РМ;
			ТЧ_О.Количество = ТЧ.Количество;	
			ТЧ_О.НВ = ТЧ.НВ;
			ТЧ_О.Стоимость = ТЧ.Стоимость;			
			КонецЦикла;
		ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ВыборкаИзделие.Изделие.Наименование);
		ОблИзделиеОбщая.Параметры.Изделие = ВыборкаИзделие.Изделие;
		ОблИзделиеОбщая.Параметры.ГруппаЛинеек = СокрЛП(ВыборкаИзделие.Изделие.Линейка.Родитель.Наименование); 
		ОблИзделиеОбщая.Параметры.Количество = Количество;
			Если СписокТО.Количество() > 0 Тогда
			ОблИзделиеОбщая.Параметры.Ошибки = "!";
            ОблИзделиеОбщая.Параметры.СписокТО = СписокТО;
			Иначе
			ОблИзделиеОбщая.Параметры.Ошибки = "";
			КонецЕсли;
		ТабДок.Вывести(ОблИзделиеОбщая);
		КоличествоВсего = КоличествоВсего + Количество;
			Для каждого РМ Из СписокРМ Цикл 
			Выборка = ТаблицаРМ.Найти(РМ.Значение,"РМ");
				Если Выборка <> Неопределено Тогда 
				ОблИзделиеРабочееМесто.Параметры.Количество = Выборка.Количество;
				ОблИзделиеРабочееМесто.Параметры.НВ = Выборка.НВ;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = Выборка.Стоимость;
				НВИтого = НВИтого + Выборка.НВ;
				НВИтогоВсего = НВИтогоВсего + Выборка.НВ;
				СтоимостьИтого = СтоимостьИтого + Выборка.Стоимость;
				СтоимостьИтогоВсего = СтоимостьИтогоВсего + Выборка.Стоимость;				
				Иначе
				ОблИзделиеРабочееМесто.Параметры.Количество = 0;	
				ОблИзделиеРабочееМесто.Параметры.НВ = 0;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = 0;				
				КонецЕсли;	
			ТабДок.Присоединить(ОблИзделиеРабочееМесто);				
			КонецЦикла;    
		ОблИзделиеИтого.Параметры.НВ = НВИтого;
		ОблИзделиеИтого.Параметры.Стоимость = СтоимостьИтого;
		ТабДок.Присоединить(ОблИзделиеИтого);
		КонецЦикла;
	ИначеЕсли ВидОтчёта = 3 Тогда
	СписокРМ_ПЗ = Новый СписокЗначений;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственноеЗадание.Изделие КАК Изделие,
		|	ПроизводственноеЗадание.Количество КАК Количество,
		|	ПроизводственноеЗадание.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ПроизводственноеЗадание.ДатаЗапуска МЕЖДУ &ДатаНач И &ДатаКон
		|	И ПроизводственноеЗадание.Линейка В ИЕРАРХИИ(&СписокЛинеек)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроизводственноеЗадание.Изделие.Товар.Наименование
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Изделие";
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания); 
	Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИзделие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИзделие.Следующий() Цикл 
		Количество = 0;
		СписокТО.Очистить();               
		ТаблицаРМ.Очистить();
		ВыборкаДетальныхЗаписей = ВыборкаИзделие.Выбрать();
			Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
			СписокРМ_ПЗ.Очистить();
			ЭПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.СоздатьНаборЗаписей();
			ЭПЗ.Отбор.ПЗ.Установить(ВыборкаДетальныхЗаписей.Ссылка);
			ЭПЗ.Прочитать();
				Для каждого Запись Из ЭПЗ Цикл
					Если (Запись.ДатаОкончания >= Период.ДатаНачала)и(Запись.ДатаОкончания <= Период.ДатаОкончания) Тогда
					СписокРМ_ПЗ.Добавить(Запись.РабочееМесто);	
					КонецЕсли;
				КонецЦикла;                                 
					Если СписокРМ_ПЗ.Количество() < КоличествоРМВЛинейке(ВыборкаДетальныхЗаписей.Ссылка.Линейка) Тогда
					ЗаполнитьТаблицуРМ(ТаблицаРМ,СписокТО,ВыборкаИзделие.Изделие,ВыборкаИзделие.Изделие.Линейка,ВыборкаДетальныхЗаписей.Ссылка.ДатаЗапуска,ВыборкаДетальныхЗаписей.Ссылка.Количество,СписокРМ_ПЗ,Ложь);					
					Количество = Количество + ВыборкаДетальныхЗаписей.Ссылка.Количество;
					КонецЕсли;			
			КонецЦикла;
				Если Количество = 0 Тогда
				Продолжить;
				КонецЕсли; 
		НВИтого = 0;
		СтоимостьИтого = 0;
		ТаблицаРМ.Свернуть("РМ","Количество,НВ,Стоимость");
		ТаблицаРМ.Сортировать("РМ"); 
			Для каждого ТЧ Из ТаблицаРМ Цикл
			ТЧ_О = ТаблицаРМОбщ.Добавить();
			ТЧ_О.РМ = ТЧ.РМ;
			ТЧ_О.Количество = ТЧ.Количество;	
			ТЧ_О.НВ = ТЧ.НВ;
			ТЧ_О.Стоимость = ТЧ.Стоимость;			
			КонецЦикла;
		ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ВыборкаИзделие.Изделие.Наименование);
		ОблИзделиеОбщая.Параметры.Изделие = ВыборкаИзделие.Изделие;
		ОблИзделиеОбщая.Параметры.ГруппаЛинеек = СокрЛП(ВыборкаИзделие.Изделие.Линейка.Родитель.Наименование); 
		ОблИзделиеОбщая.Параметры.Количество = Количество;
			Если СписокТО.Количество() > 0 Тогда
			ОблИзделиеОбщая.Параметры.Ошибки = "!";
            ОблИзделиеОбщая.Параметры.СписокТО = СписокТО;
			Иначе
			ОблИзделиеОбщая.Параметры.Ошибки = "";
			КонецЕсли;
		ТабДок.Вывести(ОблИзделиеОбщая);
		КоличествоВсего = КоличествоВсего + Количество;
			Для каждого РМ Из СписокРМ Цикл 
			Выборка = ТаблицаРМ.Найти(РМ.Значение,"РМ");
				Если Выборка <> Неопределено Тогда 
				ОблИзделиеРабочееМесто.Параметры.Количество = Выборка.Количество;
				ОблИзделиеРабочееМесто.Параметры.НВ = Выборка.НВ;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = Выборка.Стоимость;
				НВИтого = НВИтого + Выборка.НВ;
				НВИтогоВсего = НВИтогоВсего + Выборка.НВ;
				СтоимостьИтого = СтоимостьИтого + Выборка.Стоимость;
				СтоимостьИтогоВсего = СтоимостьИтогоВсего + Выборка.Стоимость;				
				Иначе
				ОблИзделиеРабочееМесто.Параметры.Количество = 0;	
				ОблИзделиеРабочееМесто.Параметры.НВ = 0;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = 0;				
				КонецЕсли;	
			ТабДок.Присоединить(ОблИзделиеРабочееМесто);				
			КонецЦикла;    
		ОблИзделиеИтого.Параметры.НВ = НВИтого;
		ОблИзделиеИтого.Параметры.Стоимость = СтоимостьИтого;
		ТабДок.Присоединить(ОблИзделиеИтого);
		КонецЦикла;
	Иначе
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПерспективныеПланы.МПЗ КАК Изделие,
		|	ПерспективныеПланы.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.ПерспективныеПланы КАК ПерспективныеПланы
		|ГДЕ
		|	ПерспективныеПланы.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ПерспективныеПланы.МПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
		|	И ПерспективныеПланы.Количество > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПерспективныеПланы.МПЗ.Товар.Наименование
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Изделие";
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания); 
	Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИзделие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИзделие.Следующий() Цикл
		СписокТО.Очистить();
		ТаблицаРМ.Очистить();
        ЗаполнитьТаблицуРМ(ТаблицаРМ,СписокТО,ВыборкаИзделие.Изделие,ВыборкаИзделие.Изделие.Линейка,ТекущаяДата(),ВыборкаИзделие.Количество);
		НВИтого = 0;
		СтоимостьИтого = 0;
		ТаблицаРМ.Свернуть("РМ","Количество,НВ,Стоимость");
		ТаблицаРМ.Сортировать("РМ"); 
			Для каждого ТЧ Из ТаблицаРМ Цикл
			ТЧ_О = ТаблицаРМОбщ.Добавить();
			ТЧ_О.РМ = ТЧ.РМ;
			ТЧ_О.Количество = ТЧ.Количество;	
			ТЧ_О.НВ = ТЧ.НВ;
			ТЧ_О.Стоимость = ТЧ.Стоимость;			
			КонецЦикла;
		ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ВыборкаИзделие.Изделие.Наименование);
		ОблИзделиеОбщая.Параметры.Изделие = ВыборкаИзделие.Изделие;
		ОблИзделиеОбщая.Параметры.ГруппаЛинеек = СокрЛП(ВыборкаИзделие.Изделие.Линейка.Родитель.Наименование); 
		ОблИзделиеОбщая.Параметры.Количество = ВыборкаИзделие.Количество;
			Если СписокТО.Количество() > 0 Тогда
			ОблИзделиеОбщая.Параметры.Ошибки = "!";
            ОблИзделиеОбщая.Параметры.СписокТО = СписокТО;
			Иначе
			ОблИзделиеОбщая.Параметры.Ошибки = "";
			КонецЕсли;
		ТабДок.Вывести(ОблИзделиеОбщая);
		КоличествоВсего = КоличествоВсего + ВыборкаИзделие.Количество;
			Для каждого РМ Из СписокРМ Цикл 
			Выборка = ТаблицаРМ.Найти(РМ.Значение,"РМ");
				Если Выборка <> Неопределено Тогда
				ОблИзделиеРабочееМесто.Параметры.НВ = Выборка.НВ;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = Выборка.Стоимость;
				НВИтого = НВИтого + Выборка.НВ;
				НВИтогоВсего = НВИтогоВсего + Выборка.НВ;
				СтоимостьИтого = СтоимостьИтого + Выборка.Стоимость;
				СтоимостьИтогоВсего = СтоимостьИтогоВсего + Выборка.Стоимость;				
				Иначе	
				ОблИзделиеРабочееМесто.Параметры.НВ = 0;
				ОблИзделиеРабочееМесто.Параметры.Стоимость = 0;				
				КонецЕсли;	
			ТабДок.Присоединить(ОблИзделиеРабочееМесто);				
			КонецЦикла;    
		ОблИзделиеИтого.Параметры.НВ = НВИтого;
		ОблИзделиеИтого.Параметры.Стоимость = СтоимостьИтого;
		ТабДок.Присоединить(ОблИзделиеИтого);
		КонецЦикла;
	КонецЕсли;
ТаблицаРМОбщ.Свернуть("РМ","Количество,НВ,Стоимость");
ОблКонецОбщая.Параметры.Количество = КоличествоВсего;
ТабДок.Вывести(ОблКонецОбщая);
	Для каждого РМ Из СписокРМ Цикл
	Выборка = ТаблицаРМОбщ.Найти(РМ.Значение,"РМ"); 
		Если Выборка <> Неопределено Тогда                          
		ОблКонецРабочееМесто.Параметры.НВ = Выборка.НВ;
		ОблКонецРабочееМесто.Параметры.Стоимость = Выборка.Стоимость;		
		Иначе
		ОблКонецРабочееМесто.Параметры.НВ = 0;	
		ОблКонецРабочееМесто.Параметры.Стоимость = 0;		
		КонецЕсли;
	ТабДок.Присоединить(ОблКонецРабочееМесто);				
	КонецЦикла;
ОблКонецИтого.Параметры.НВ = НВИтогоВсего;                                         
ОблКонецИтого.Параметры.Стоимость = СтоимостьИтогоВсего;
ТабДок.Присоединить(ОблКонецИтого);
ТабДок.ФиксацияСверху = 4;
ТабДок.ФиксацияСлева = 4;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Состояние("Обработка...",,"Формирование таблицы отчёта...");
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры
